# Series in Pandas

## importing libraries

In [2]:
import pandas as pd

## Creating first Series

In [5]:
about_me=['arun','verma']
s=pd.Series(about_me)
a=s.values
i=s.index

### Intro to Methods

In [5]:
i=[1.3,6.4,3.2]
j=[0,1,2]
s1=pd.Series(i,j)
s1.sum()

10.9

In [8]:
s1.product()

26.624000000000002

In [9]:
s1.mean()

3.6333333333333333

### Parameters

In [10]:
data=['apple','banana']
day=['monday','tuesday']

s2=pd.Series(data, index=day)
s2

monday      apple
tuesday    banana
dtype: object

## Work on CSV Files

### Read a CSV File

In [41]:
cities=pd.read_csv("data/cities.csv") #,index_col="City")

In [43]:
cities.head(3)

,LatD,"""LatM""","""LatS""","""NS""","""LonD""","""LonM""","""LonS""","""EW""","""City""","""State"""
0,41,5,59,"""N""",80,39,0,"""W""","""Youngstown""",OH
1,42,52,48,"""N""",97,23,23,"""W""","""Yankton""",SD
2,46,35,59,"""N""",120,30,36,"""W""","""Yakima""",WA

In [9]:
cities.sort_values(by="LatD",ascending=True,inplace=True)

In [42]:
cities.head()

,LatD,"""LatM""","""LatS""","""NS""","""LonD""","""LonM""","""LonS""","""EW""","""City""","""State"""
0,41,5,59,"""N""",80,39,0,"""W""","""Youngstown""",OH
1,42,52,48,"""N""",97,23,23,"""W""","""Yankton""",SD
2,46,35,59,"""N""",120,30,36,"""W""","""Yakima""",WA
3,42,16,12,"""N""",71,48,0,"""W""","""Worcester""",MA
4,43,37,48,"""N""",89,46,11,"""W""","""Wisconsin Dells""",WI

In [18]:
52 in cities.index

True

In [40]:
cities[LatD]

NameError: name 'LatD' is not defined